content-org/me.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: 

#+TITLE: Me

#+HUGO_CUSTOM_FRONT_MATTER: :drop_cap false

#+OPTIONS: author:nil

I'm Krish Matta.

* Work
I'm a student at Carnegie Mellon University in Pittsburgh, Pennsylvania. While my degree title states computer science, I'm interested in much more. I have worked for/collaborated with: NASA Goddard Space Flight Center (2022), University of Delaware Safro Research Group (2021 - 2023), and Roblox (2023).

* Sites
- [[https://github.com/krishxmatta][GitHub]]
- [[https://www.linkedin.com/in/krishxmatta/][LinkedIn]]
- [[https://www.goodreads.com/user/show/164088838-krish-matta][Goodreads]]

* Contact
You may contact me via email at [[mailto:self@krishxmatta.dev][self@krishxmatta.dev]].
