content/me.md
+++
title = "Me"
draft = false
drop_cap = false
+++

I'm Krish Matta.


## Work {#work}

I'm a student at Carnegie Mellon University in Pittsburgh, Pennsylvania. While my degree title states computer science, I'm interested in much more. I have worked for/collaborated with: NASA Goddard Space Flight Center (2022), University of Delaware Safro Research Group (2021 - 2023), and Roblox (2023).


## Sites {#sites}

-   [GitHub](https://github.com/krishxmatta)
-   [LinkedIn](https://www.linkedin.com/in/krishxmatta/)
-   [Goodreads](https://www.goodreads.com/user/show/164088838-krish-matta)


## Contact {#contact}

You may contact me via email at [self@krishxmatta.dev](mailto:self@krishxmatta.dev).
